/*
Найти в первом числе все пары цифр, произведение которых равно второму аргументу,
и вернуть строку с индексами этих цифр, записанными подряд.

Если таких пар несколько, достаточно вернуть первую попавшуюся.
дважды брать одну и ту же цифру нельзя, например при findMultiply(33, 9) ответ должен быть "01", а не "00"

Если ни одной подходящей пары нет, вернуть строку “-1-1”.

findMultiply(1234567890, 18) => 18
👆18, потому что по индексу [1] лежит цифра "2", а по индексу [8] лежит "9", 2 и 9 в сумме даёт 18

findMultiply(1234567890, 12) => 23
👆23, потому что по индексу [2] число 3, а по индексу [3] число 4, а 3*4 = 12

findMultiply(592729, 81) => 15
findMultiply(123, 5) => -1-1
findMultiply(55, 25) => 01
 */

const findMultiply = (setOfNumbers, number) => {
  setOfNumbers = String(setOfNumbers);
  let result = '';
  for (let i = 0; i < setOfNumbers.length - 1; i++) {
    for (let j = 0; j < setOfNumbers.length - 1; j++) {
      if (setOfNumbers[i] * setOfNumbers[j + i + 1] === number) {
        result = i;
        result += `${j + i + 1}`;
        break;
      }
    }
  }
  if (result === '') {
    return '-1-1';
  } else {
    return result;
  }
};

console.log(findMultiply(55, 25));
console.log(findMultiply(592729, 81));
console.log(findMultiply(123, 5));
